ejercicio1/app/Controllers/Productos.php

    public function index()
    {

        echo '<br><br><br><br>';

        $db = \Config\Database::connect();
        $builder = $db->table('productos');
        $builder->select(
            'productos.id_almacen,
                            productos.codigo,
                            productos.nombre,
                            productos.stock,
                            almacen.nombre as almacen'
        );
        $builder->join('almacen', 'productos.id_almacen=almacen.idalmacen');
        $query = $builder->get();
---
SELECT *
FROM `productos`